output.txt
starting benchmark...
spawning thread #0: 100 total client(s). Timing-based test with 1s of warm-up time and 5s of main duration for measurements.
Warm-up started for thread #0.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
Application protocol: http/1.1
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 6.00s, 79327.40 req/s, 9.61MB/s
requests: 396637 total, 432259 started, 396637 done, 396637 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 396637 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 48.04MB (50376040) total, 37.16MB (38964710) headers (space savings 0.00%), 5.36MB (5623320) data
                     min         max         mean         sd        +/- sd
time for request:       61us    139.41ms     12.33ms     14.46ms    89.90%
time for connect:       21us       107us        53us        19us    65.00%
time to 1st byte:    52.27ms    127.86ms     76.27ms     19.39ms    80.36%
req/s           :     665.14      901.21      793.07       54.91    72.00%